In [1]:
import sqlalchemy as sqla
import pandas as pd

## Connect To Database
I have recreated the chinook database in a PostGreSQL Database located on an elephantsql.com instance. So I connect to it here using sql alchemy.

In [2]:
db = sqla.create_engine('postgresql://iocfzhch:JND-pk5HOtsiz0ke3MWJY_goqVDJQNE0@drona.db.elephantsql.com:5432/iocfzhch')

## Writing The Join Query

I inner join the database on the five tables that we need in order to get the columns of last name, first name, name, and title. Then I have pandas read the query from the database into a dataframe under the name chinook.

In [3]:
sql = '''SELECT "LastName","FirstName","Name","Title"
        FROM "public"."Customer"
        JOIN "Invoice" ON "Customer"."CustomerId" = "Invoice"."CustomerId"
        JOIN "InvoiceLine" ON "Invoice"."InvoiceId" = "InvoiceLine"."InvoiceId"
        JOIN "Track" ON "InvoiceLine"."TrackId" = "Track"."TrackId" 
        JOIN "Album" ON "Track"."AlbumId" = "Album"."AlbumId"
        ORDER BY "LastName", "FirstName"'''
chinook = pd.read_sql(sql, db)

## The Dataframe

We now have a dataframe that is ordered by customer last name and then first name which shows which tracks they bought and from what album they were.

In [4]:
chinook.head()

  LastName FirstName              Name                         Title
0  Almeida   Roberto  Fool In The Rain       In Through The Out Door
1  Almeida   Roberto               Eye  Rotten Apples: Greatest Hits
2  Almeida   Roberto    Be Good Johnny       The Best Of Men At Work
3  Almeida   Roberto   Down by the Sea       The Best Of Men At Work
4  Almeida   Roberto    It's a Mistake       The Best Of Men At Work